# Лекция №3. Работа с табличными данными - pandas

![](https://miro.medium.com/max/1978/1*k3PsTP1ibp4CTLJ3ofVlqg.jpeg)

Содержание:

1. Осматриваемся
2. Тип данных pd.Series
3. Тип данных pd.DataFrame
4. Срезы
5. Полезные мелочи

Pandas - библиотека, работы с данными и анализа данных.
Работает с таблицами. Умеет объединять таблицы, сортировать таблицы, заполнять значения, аггрегировать данные и т.п.
Умеет работать с экселевскими таблицами.

Полезные ссылки:
* [Документация](https://pandas.pydata.org/docs/)
* [Документация: 10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)
* [Документация: User Guide](https://pandas.pydata.org/docs/user_guide/index.html#user-guide)

In [1]:
import pandas as pd

In [4]:
# !conda install -c anaconda pandas -y

## Learning from tragedy: анализ данных на примере "Титаника"
![](http://www.maritimequest.com/liners/titanic/photos/emil_besirevic/titanic_emil_besirevic_01.jpg)

<br><br>

## 1. Осматриваемся

In [5]:
#считываем dataframe в переменную pasInfo
pasInfo = pd.read_csv('titanic_data.csv')

Другие методы чтения
* read_excel
* read_json
* ...

Параметры:
* sep
* skiprows
* nrows
* parse_dates
* names
* index_col
* usecols
* ...

In [ ]:
?pd.read_csv

In [7]:
# длина таблицы
print(len(pasInfo))

891

In [8]:
# размеры всех измерений таблицы: число строк и столбцов
print(pasInfo.shape)

(891, 11)

In [9]:
# тип объекта - ДатаФрейм
type(pasInfo)

pandas.core.frame.DataFrame

In [11]:
#просматриваем часть колонок
pasInfo.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [12]:
pasInfo.tail(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
#двумерный размер датафрейма
pasInfo.shape

In [13]:
#имена колонок
pasInfo.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
type(pasInfo.columns)

pandas.core.indexes.base.Index

In [15]:
list(pasInfo.columns)

['PassengerId',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [ ]:
# list(pasInfo.columns)

In [16]:
# индекс
pasInfo.index

RangeIndex(start=0, stop=891, step=1)

In [17]:
type(pasInfo.index)

pandas.core.indexes.range.RangeIndex

In [19]:
# list(pasInfo.index)

In [20]:
# выбрать колонку
pasInfo['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [21]:
type(pasInfo['Pclass'])

pandas.core.series.Series

In [22]:
(pasInfo['Pclass']).value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [23]:
len(pasInfo)

891

In [28]:
# (pasInfo['Cabin']).value_counts(dropna=False)

In [29]:
type(pasInfo)

pandas.core.frame.DataFrame

In [30]:
type(pasInfo['Pclass'])

pandas.core.series.Series

In [ ]:
pasInfo['Age']

In [32]:
[1,2,3] + [1,2,3]

[1, 2, 3, 1, 2, 3]

In [35]:
pasInfo['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [36]:
len(pasInfo['Age'])

891

In [34]:
pasInfo['Age'] + pasInfo['Age']

0      44.0
1      76.0
2      52.0
3      70.0
4      70.0
       ...
886    54.0
887    38.0
888     NaN
889    52.0
890    64.0
Name: Age, Length: 891, dtype: float64

In [38]:
pasInfo['Age'] * 10

0      220.0
1      380.0
2      260.0
3      350.0
4      350.0
       ...
886    270.0
887    190.0
888      NaN
889    260.0
890    320.0
Name: Age, Length: 891, dtype: float64

In [37]:
len(pasInfo['Age'] + pasInfo['Age'])

891

In [41]:
pasInfo['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
# pasInfo['Age'] + pasInfo['Age']

**Что знаем и умеем?**

* Познакомились с csv-файлами
* Основные типы данных pandas: `pd.DataFrame`, `pd.Series`
* Чтение файлов в pandas:
    * `pd.read_csv`
    * `pd.read_excel`
    * `pd.read_json`
    * параметры этих функций
* `df.columns`, `df.index`
* Выделям столбцы таблички: `df['col']`
* `len(df)`, `df.shape`, `df.head()`, `df.tail`
* `series.value_counts()`

<br><br>

## 2. Тип данных pd.Series

In [43]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [44]:
pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3})

a    1
b    2
c    3
d    3
dtype: int64

In [47]:
pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3}).shape

(4,)

In [45]:
pd.DataFrame(pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3}))

   0
a  1
b  2
c  3
d  3

In [46]:
pd.DataFrame(pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3})).shape

(4, 1)

In [48]:
pd.DataFrame(pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3}), columns=['my_column'])

   my_column
a          1
b          2
c          3
d          3

In [49]:
pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3}).to_dict()

{'a': 1, 'b': 2, 'c': 3, 'd': 3}

In [52]:
temp = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 3})

In [53]:
temp

a    1
b    2
c    3
d    3
dtype: int64

In [54]:
temp * 3

a    3
b    6
c    9
d    9
dtype: int64

In [55]:
temp + temp

a    2
b    4
c    6
d    6
dtype: int64

In [65]:
pd.Series({'a': 1, 'b': 1, 'c': 2, 'd': 2, 'e': 2, 'f': 3})

a    1
b    1
c    2
d    2
e    2
f    3
dtype: int64

In [66]:
pd.Series({'a': 1, 'b': 1, 'c': 2, 'd': 2, 'e': 2, 'f': 3}).unique()

array([1, 2, 3])

In [67]:
pd.Series({'a': 1, 'b': 1, 'c': 2, 'd': 2, 'e': 2, 'f': 3}).nunique()

3

In [100]:
temp

a    1
b    2
c    3
d    3
dtype: int64

In [101]:
temp.value_counts()

3    2
2    1
1    1
dtype: int64

In [102]:
temp.value_counts(normalize=True)

3    0.50
2    0.25
1    0.25
dtype: float64

In [59]:
temp.unique()

array([1, 2, 3])

In [60]:
temp.nunique()

3

In [64]:
temp.sum()

9

In [ ]:
# other functions: mean, median, std, max, min, sum, ....

In [68]:
temp

a    1
b    2
c    3
d    3
dtype: int64

In [69]:
temp.value_counts()

3    2
2    1
1    1
dtype: int64

In [70]:
type(temp.value_counts())

pandas.core.series.Series

In [71]:
temp2 = temp.value_counts()

In [73]:
temp2.to_dict()

{3: 2, 2: 1, 1: 1}

In [76]:
temp2

3    2
2    1
1    1
dtype: int64

In [75]:
temp2 == temp2

3    True
2    True
1    True
dtype: bool

In [78]:
temp2 == pd.Series({3: 1, 2:1, 1:1})

3    False
2     True
1     True
dtype: bool

In [82]:
# temp2 == pd.Series({4: 2, 2:1, 1:1})

In [84]:
temp2 == 1

3    False
2     True
1     True
dtype: bool

In [85]:
type(temp2 == 1)

pandas.core.series.Series

In [86]:
temp

a    1
b    2
c    3
d    3
dtype: int64

In [87]:
temp == 3

a    False
b    False
c     True
d     True
dtype: bool

In [88]:
temp[temp == 3]

c    3
d    3
dtype: int64

In [90]:
temp[temp == 2]

b    2
dtype: int64

In [91]:
temp[temp == 1]

a    1
dtype: int64

In [93]:
type(temp[temp == 3])

pandas.core.series.Series

In [94]:
temp.values

array([1, 2, 3, 3])

In [97]:
temp.values[2]

3

In [98]:
list(temp.values)

[1, 2, 3, 3]

In [99]:
set(temp.values)

{1, 2, 3}

**Что знаем и умеем?**

* `pd.Series`. Создаём из списка, из словаря. Превращаем `pd.Series` в словарь, в список, в множество
* Важное свойство: поэлементные операции. Арифметические операции с числами или с другими `pd.Series`
* `pd.Series.value_counts()`, параметр `normalize`
* `unique`, `nunique`
* `mean`, `std`, `median`, `sum`, `max`, `min`, ...
* Проверка значений ряда на равенство с числом/переменной/объектом
* Индексация ряда булевым рядом

<br><br>

## 3. Тип данных pd.DataFrame

In [103]:
# зададим датафрейм
df = pd.DataFrame(index=[1,2,3,4], columns=['a','b','c'], data=[[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [104]:
df

    a   b   c
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [105]:
df = pd.DataFrame(data=[[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [106]:
df

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [107]:
# зададим датафрейм
df = pd.DataFrame(index=[1,2,3,4], columns=['a','b','c'], data=[[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [108]:
# по-другому
df = pd.DataFrame()

In [111]:
df['a'] = [1,2,3,4]

In [112]:
df['b'] = [5,6,7,8]

In [113]:
df

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [114]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [115]:
df.index = ['row1', 'row2', 'row3', 'row4']

In [116]:
df

      a  b
row1  1  5
row2  2  6
row3  3  7
row4  4  8

In [117]:
df.columns

Index(['a', 'b'], dtype='object')

In [118]:
df.columns = ['col1', 'col2']

In [119]:
df

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8

In [121]:
df.append(df)

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8
row1     1     5
row2     2     6
row3     3     7
row4     4     8

In [122]:
df.append(df, ignore_index=True)

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8
4     1     5
5     2     6
6     3     7
7     4     8

In [123]:
df

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8

In [125]:
df.append(pd.Series({'col1': 1, 'col2': 2}), ignore_index=True)

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8
4     1     2

In [128]:
pd.Series({'col1': 1, 'col2': 2})

col1    1
col2    2
dtype: int64

In [129]:
pd.DataFrame(pd.Series({'col1': 1, 'col2': 2}))

      0
col1  1
col2  2

In [130]:
pd.DataFrame(pd.Series({'col1': 1, 'col2': 2})).T

   col1  col2
0     1     2

In [131]:
df.append(pd.DataFrame(pd.Series({'col1': 1, 'col2': 2})).T)

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8
0        1     2

In [132]:
df * 3

      col1  col2
row1     3    15
row2     6    18
row3     9    21
row4    12    24

In [133]:
df + df

      col1  col2
row1     2    10
row2     4    12
row3     6    14
row4     8    16

In [134]:
df * df

      col1  col2
row1     1    25
row2     4    36
row3     9    49
row4    16    64

In [135]:
for el in df:
    print(el)

col1
col2

In [136]:
for el in df.iterrows():
    print(el)

('row1', col1    1
col2    5
Name: row1, dtype: int64)
('row2', col1    2
col2    6
Name: row2, dtype: int64)
('row3', col1    3
col2    7
Name: row3, dtype: int64)
('row4', col1    4
col2    8
Name: row4, dtype: int64)

In [137]:
for el in df.iterrows():
    print(type(el))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [138]:
list(df.iterrows())[0]

('row1',
 col1    1
 col2    5
 Name: row1, dtype: int64)

In [140]:
list(df.iterrows())[0][1]

col1    1
col2    5
Name: row1, dtype: int64

In [ ]:
list(df.itertuples())

In [141]:
for el in df.itertuples():
    print(el)

Pandas(Index='row1', col1=1, col2=5)
Pandas(Index='row2', col1=2, col2=6)
Pandas(Index='row3', col1=3, col2=7)
Pandas(Index='row4', col1=4, col2=8)

In [144]:
for el in df.itertuples():
    print(el.Index)

row1
row2
row3
row4

In [145]:
for col in df.columns:
    print(df[col])

row1    1
row2    2
row3    3
row4    4
Name: col1, dtype: int64
row1    5
row2    6
row3    7
row4    8
Name: col2, dtype: int64

In [146]:
df['col1']

row1    1
row2    2
row3    3
row4    4
Name: col1, dtype: int64

In [147]:
df[['col1']]

      col1
row1     1
row2     2
row3     3
row4     4

In [148]:
df[['col1', 'col2']]

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8

In [149]:
slice_df = df[['col1', 'col2']]

In [150]:
df

      col1  col2
row1     1     5
row2     2     6
row3     3     7
row4     4     8

In [151]:
df[['col2', 'col1']]

      col2  col1
row1     5     1
row2     6     2
row3     7     3
row4     8     4

In [152]:
df = df[['col2', 'col1']]

In [153]:
df

      col2  col1
row1     5     1
row2     6     2
row3     7     3
row4     8     4

In [154]:
df.reindex(['row3', 'row4', 'row1', 'row2'])

      col2  col1
row3     7     3
row4     8     4
row1     5     1
row2     6     2

In [155]:
df.values

array([[5, 1],
       [6, 2],
       [7, 3],
       [8, 4]])

In [156]:
df.values[0]

array([5, 1])

In [158]:
df.values[0][0]

5

In [ ]:
df = pd.DataFrame()

In [159]:
df

      col2  col1
row1     5     1
row2     6     2
row3     7     3
row4     8     4

In [160]:
df.to_csv('some_table.csv', index=None)

In [161]:
temp = pd.read_csv('some_table.csv')

In [162]:
temp

   col2  col1
0     5     1
1     6     2
2     7     3
3     8     4

In [163]:
df.to_csv('some_table_2.csv')

In [170]:
df.to_excel('some_table_2.xlsx')

In [169]:
!conda install openpyxl -y

Collecting package metadata (current_repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
  current version: 4.8.3
  latest version: 4.9.2

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /Users/magnitofon/opt/anaconda3/envs/my_coursera

  added / updated specs:
    - openpyxl


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2020.10.14 |                0         121 KB
    openpyxl-3.0.5             |             py_0         158 KB
    openssl-1.1.1h             |       haf1e3a3_0         2.2 MB
    ------------------------------------------------------------
                                           Total:         2.5 MB

The following NEW packages will be INSTALLED:

  et_xmlfile         pkgs/main/noarch::et_xmlfile-1.0.1-py_1001
  jdcal              pkgs/main/noarch::jdcal-1.4.1-py_0
  openpyxl           pkgs/main/noarch::openpyxl-3.0.5-py_0

The following packages will be UPDATED:

  certifi            anaconda/osx-64::certifi-2020.6.20-py~ --> pkgs/main/noarch::certifi-2020.6.20-pyhd3eb1b0_3

The following packages will be SUPERSEDED by a higher-priority channel:

  ca-certificates                                  anaconda --> pkgs/main
  openssl                                          anaconda --> pkgs/main



Downloading and Extracting Packages
openpyxl-3.0.5       | 158 KB    | ##################################### | 100%
ca-certificates-2020 | 121 KB    | ##################################### | 100%
openssl-1.1.1h       | 2.2 MB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [166]:
temp = pd.read_csv('some_table_2.csv')

In [167]:
temp

  Unnamed: 0  col2  col1
0       row1     5     1
1       row2     6     2
2       row3     7     3
3       row4     8     4

**Что знаем и умеем?**

* `pd.DataFrame`. Создаём различными способами
* Важное свойство: поэлементные операции. Арифметические операции с числами или с другими `pd.DataFrame`
* Добавление колонок
* `df.append` - добавление другого `pd.DataFrame`; добавление одной строки
* Итерация по `df` различными способами. Итерация по строкам. Итерация по столбцам
* Меняем порядок столбцов
* `df.reindex` - меняем порядок строк
* Сохраняем результат:
    * `df.to_csv(...)`
    * `df.to_excel(...)`
    * ...

<br><br>

## 4. Срезы

In [171]:
df = pd.DataFrame(index=[1,2,3,4], columns=['a','b','c'], data=[[1,2,3],[4,5,6],[7,8,9],[10,11,12]])

In [176]:
df

    a   b   c
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [173]:
df['a']

1     1
2     4
3     7
4    10
Name: a, dtype: int64

In [174]:
df[['a', 'b']]

    a   b
1   1   2
2   4   5
3   7   8
4  10  11

In [175]:
df[0:3]

   a  b  c
1  1  2  3
2  4  5  6
3  7  8  9

In [177]:
df[1:3]

   a  b  c
2  4  5  6
3  7  8  9

In [181]:
# df[1]

In [189]:
df.iloc[3]

a    10
b    11
c    12
Name: 4, dtype: int64

In [190]:
df.iloc[3,:]

a    10
b    11
c    12
Name: 4, dtype: int64

In [191]:
df.iloc[:,0]

1     1
2     4
3     7
4    10
Name: a, dtype: int64

In [192]:
df.iloc[[0,1],[0,1]]

   a  b
1  1  2
2  4  5

In [193]:
df.iloc[2,0]

7

In [ ]:
df[0:3][['a', 'b']]

In [ ]:
df.loc[0:3, ['a', 'b']]

In [ ]:
#df.loc[0:3, ['a', 'b']]

In [200]:
df

    a   b   c
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [201]:
# df.iloc[[4],:]

In [203]:
df.loc[[4],:]

    a   b   c
4  10  11  12

In [198]:
df.loc[[4],['a','b']]

    a   b
4  10  11

In [204]:
df

    a   b   c
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [205]:
df.index = ['row1', 'row2', 'row3', 'row4']

In [206]:
df

       a   b   c
row1   1   2   3
row2   4   5   6
row3   7   8   9
row4  10  11  12

In [207]:
df.iloc[1,1]

5

In [209]:
df.loc['row2','b']

5

In [210]:
df.loc['row1':'row3', ['a', 'b']]

      a  b
row1  1  2
row2  4  5
row3  7  8

In [212]:
df.loc['row1':'row3', 'a':'c']

      a  b  c
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [216]:
# df.loc['row1':'row3', 'a':'c'].iloc[1:2,0:2].loc['row2',:]

In [ ]:
df.iloc[0:3,0:3]

In [217]:
df

       a   b   c
row1   1   2   3
row2   4   5   6
row3   7   8   9
row4  10  11  12

In [218]:
df2 = df

In [219]:
df2

       a   b   c
row1   1   2   3
row2   4   5   6
row3   7   8   9
row4  10  11  12

In [220]:
df2.loc['row2', 'a']

4

In [221]:
df2.loc['row2', 'a'] = 100

In [222]:
df2.loc['row2', 'a']

100

In [223]:
df2

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [224]:
df

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [225]:
df3 = df.copy()

In [226]:
df3

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [227]:
df3.loc['row3', 'b']

8

In [228]:
df3.loc['row3', 'b'] = 9999

In [229]:
df3

        a     b   c
row1    1     2   3
row2  100     5   6
row3    7  9999   9
row4   10    11  12

In [230]:
df2

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [231]:
df

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [236]:
def func(df):
    df.iloc[0,0] = -999
    return df

In [233]:
df

        a   b   c
row1    1   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [237]:
df4 = func(df)

In [239]:
df4

        a   b   c
row1 -999   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [240]:
df

        a   b   c
row1 -999   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [242]:
df.iloc[0,0] = 10

In [243]:
df

        a   b   c
row1   10   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [241]:
def func(df):
    df = df.copy()
    df.iloc[0,0] = -999
    return df

In [244]:
df5 = func(df)

In [245]:
df5

        a   b   c
row1 -999   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [246]:
df

        a   b   c
row1   10   2   3
row2  100   5   6
row3    7   8   9
row4   10  11  12

In [247]:
#считываем dataframe в переменную pasInfo
pasInfo = pd.read_csv('titanic_data.csv')

In [248]:
pasInfo

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [251]:
temp = df['b']

In [252]:
temp

row1     2
row2     5
row3     8
row4    11
Name: b, dtype: int64

In [253]:
temp == 5

row1    False
row2     True
row3    False
row4    False
Name: b, dtype: bool

In [254]:
temp[temp == 5]

row2    5
Name: b, dtype: int64

In [256]:
temp[temp > 5]

row3     8
row4    11
Name: b, dtype: int64

In [259]:
pasInfo.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [260]:
pasInfo['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [261]:
pasInfo['Pclass'] == 3

0       True
1      False
2       True
3      False
4       True
       ...
886    False
887    False
888     True
889    False
890     True
Name: Pclass, Length: 891, dtype: bool

In [262]:
pasInfo[pasInfo['Pclass'] == 3]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
882,883,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [263]:
type(pasInfo[pasInfo['Pclass'] == 3])

pandas.core.frame.DataFrame

In [264]:
temp = pasInfo[pasInfo['Pclass'] == 3]

In [266]:
temp['Age'].mean()

25.14061971830986

In [267]:
temp = pasInfo[pasInfo['Pclass'] == 3].copy()

In [268]:
pasInfo[pasInfo['Pclass'] == 2]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
15,16,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
17,18,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
20,21,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...
866,867,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
880,881,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
883,884,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S

In [269]:
len(pasInfo[pasInfo['Pclass'] == 2])

184

In [271]:
pasInfo['Pclass'].isin([2,3])

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Pclass, Length: 891, dtype: bool

In [272]:
len(pasInfo[pasInfo['Pclass'].isin([2,3])])

675

In [ ]:
pasInfo[pasInfo['Pclass'].isin([2,3])]

In [273]:
pasInfo['Age'] < 22

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887     True
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [274]:
pasInfo[pasInfo['Age'] < 22]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,13,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
14,15,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
869,870,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [275]:
(pasInfo['Pclass'].isin([2,3])) & (pasInfo['Age'] < 22)

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [276]:
pasInfo[(pasInfo['Pclass'].isin([2,3])) & (pasInfo['Age'] < 22)]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,13,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
14,15,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
861,862,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
869,870,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S

In [277]:
condition_1 = pasInfo['Pclass'].isin([2,3])

In [278]:
condition_2 = pasInfo['Age'] < 22

In [280]:
type(condition_1), type(condition_2)

(pandas.core.series.Series, pandas.core.series.Series)

In [281]:
pasInfo[condition_1 & condition_2]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,13,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
14,15,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
861,862,2,"Giles, Mr. Frederick Edward",male,21.0,1,0,28134,11.5000,NaN,S
869,870,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
875,876,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
876,877,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S
877,878,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S

In [282]:
pasInfo[condition_1 | condition_2]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [283]:
pasInfo[~condition_1]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
pasInfo[~condition_1]['Age'].mean()

In [ ]:
pasInfo[condition_1]['Age'].mean()

In [288]:
pasInfo.loc[condition_1 & condition_2, ['Age', 'Fare']]

      Age     Fare
7     2.0  21.0750
9    14.0  30.0708
10    4.0  16.7000
12   20.0   8.0500
14   14.0   7.8542
..    ...      ...
861  21.0  11.5000
869   4.0  11.1333
875  15.0   7.2250
876  20.0   9.8458
877  19.0   7.8958

[180 rows x 2 columns]

In [290]:
temp = pasInfo.loc[condition_1 & condition_2, ['Age', 'Fare']].copy()

In [291]:
temp

      Age     Fare
7     2.0  21.0750
9    14.0  30.0708
10    4.0  16.7000
12   20.0   8.0500
14   14.0   7.8542
..    ...      ...
861  21.0  11.5000
869   4.0  11.1333
875  15.0   7.2250
876  20.0   9.8458
877  19.0   7.8958

[180 rows x 2 columns]

In [ ]:
# pasInfo.loc[condition_1, ['Age', 'Fare']]

In [ ]:
# правильнее всего для срезов использовать конструкцию loc:
# df.loc[условия, колонки]

df_slice = pasInfo.loc[((pasInfo['Pclass'] == 3) & (pasInfo['Embarked'] == 'S')), ['Sex', 'Age']]
print(df_slice.shape)

In [ ]:
condition = ((pasInfo['Pclass'] == 3) & (pasInfo['Embarked'] == 'S'))
columns = ['Sex', 'Age']

In [ ]:
# если нет условий, а нужно выбрать только колонки
df_slice = pasInfo.loc[:, columns]

In [ ]:
# и наоборот, если есть только условия, а колонки нужы все
df_slice = pasInfo.loc[condition, :]

In [ ]:
# срез и по условиям и по колонкам
df_slice = pasInfo.loc[condition, columns]

In [327]:
temp_table = pasInfo[condition_1]

In [294]:
temp_table['Fare']

0       7.2500
2       7.9250
4       8.0500
5       8.4583
7      21.0750
        ...
884     7.0500
885    29.1250
886    13.0000
888    23.4500
890     7.7500
Name: Fare, Length: 675, dtype: float64

In [295]:
temp_table[temp_table['Fare'] > 20]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
13,14,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
16,17,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
20,21,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
863,864,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
874,875,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
880,881,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [302]:
type(temp_table['Cabin'][0])

float

In [303]:
temp_table['Cabin'][0]

nan

In [304]:
temp_table['Cabin'][0]  + 5

nan

In [296]:
temp_table['Cabin'].value_counts()

G6       4
F2       3
D        3
E101     3
F33      3
F4       2
F G73    2
E121     2
E77      1
F E69    1
F38      1
F G63    1
D56      1
E10      1
Name: Cabin, dtype: int64

In [305]:
temp_table['Cabin'].value_counts(dropna=True)

G6       4
F2       3
D        3
E101     3
F33      3
F4       2
F G73    2
E121     2
E77      1
F E69    1
F38      1
F G63    1
D56      1
E10      1
Name: Cabin, dtype: int64

In [297]:
temp_table['Cabin'].value_counts(dropna=False)

NaN      647
G6         4
F2         3
D          3
E101       3
F33        3
F4         2
F G73      2
E121       2
E77        1
F E69      1
F38        1
F G63      1
D56        1
E10        1
Name: Cabin, dtype: int64

In [307]:
temp_table['Cabin'].isnull()

0      True
2      True
4      True
5      True
7      True
       ...
884    True
885    True
886    True
888    True
890    True
Name: Cabin, Length: 675, dtype: bool

In [308]:
temp_table[temp_table['Cabin'].isnull()]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
884,885,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [309]:
temp_table['Cabin'].notnull()

0      False
2      False
4      False
5      False
7      False
       ...
884    False
885    False
886    False
888    False
890    False
Name: Cabin, Length: 675, dtype: bool

In [310]:
temp_table[temp_table['Cabin'].notnull()]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
21,22,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
66,67,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S
75,76,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
123,124,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13.0000,E101,S
128,129,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
148,149,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
183,184,2,"Becker, Master. Richard F",male,1.0,2,1,230136,39.0000,F4,S
193,194,2,"Navratil, Master. Michel M",male,3.0,1,1,230080,26.0000,F2,S
205,206,3,"Strom, Miss. Telma Matilda",female,2.0,0,1,347054,10.4625,G6,S
251,252,3,"Strom, Mrs. Wilhelm (Elna Matilda Persson)",female,29.0,1,1,347054,10.4625,G6,S
292,293,2,"Levy, Mr. Rene Jacques",male,36.0,0,0,SC/Paris 2163,12.8750,D,C
303,304,2,"Keane, Miss. Nora A",female,NaN,0,0,226593,12.3500,E101,Q
327,328,2,"Ball, Mrs. (Ada E Hall)",female,36.0,0,0,28551,13.0000,D,S
340,341,2,"Navratil, Master. Edmond Roger",male,2.0,1,1,230080,26.0000,F2,S
345,346,2,"Brown, Miss. Amelia ""Mildred""",female,24.0,0,0,248733,13.0000,F33,S
394,395,3,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.0,0,2,PP 9549,16.7000,G6,S
429,430,3,"Pickard, Mr. Berk (Berk Trembisky)",male,32.0,0,0,SOTON/O.Q. 392078,8.0500,E10,S
473,474,2,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",female,23.0,0,0,SC/AH Basle 541,13.7917,D,C
516,517,2,"Lemore, Mrs. (Amelia Milley)",female,34.0,0,0,C.A. 34260,10.5000,F33,S
618,619,2,"Becker, Miss. Marion Louise",female,4.0,2,1,230136,39.0000,F4,S
699,700,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42.0,0,0,348121,7.6500,F G63,S
715,716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S
717,718,2,"Troutt, Miss. Edwina Celia ""Winnie""",female,27.0,0,0,34218,10.5000,E101,S
751,752,3,"Moor, Master. Meier",male,6.0,0,1,392096,12.4750,E121,S
772,773,2,"Mack, Mrs. (Mary)",female,57.0,0,0,S.O./P.P. 3,10.5000,E77,S
776,777,3,"Tobin, Mr. Roger",male,NaN,0,0,383121,7.7500,F38,Q
823,824,3,"Moor, Mrs. (Beila)",female,27.0,0,1,392096,12.4750,E121,S

In [311]:
temp_table['Age'].isnull()

0      False
2      False
4      False
5       True
7      False
       ...
884    False
885    False
886    False
888     True
890    False
Name: Age, Length: 675, dtype: bool

In [312]:
temp_table['Age'].isnull().value_counts()

False    528
True     147
Name: Age, dtype: int64

In [313]:
temp_table.dropna()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
21,22,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
66,67,2,"Nye, Mrs. (Elizabeth Ramell)",female,29.0,0,0,C.A. 29395,10.5000,F33,S
75,76,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
123,124,2,"Webber, Miss. Susan",female,32.5,0,0,27267,13.0000,E101,S
148,149,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
183,184,2,"Becker, Master. Richard F",male,1.0,2,1,230136,39.0000,F4,S
193,194,2,"Navratil, Master. Michel M",male,3.0,1,1,230080,26.0000,F2,S
205,206,3,"Strom, Miss. Telma Matilda",female,2.0,0,1,347054,10.4625,G6,S
251,252,3,"Strom, Mrs. Wilhelm (Elna Matilda Persson)",female,29.0,1,1,347054,10.4625,G6,S
292,293,2,"Levy, Mr. Rene Jacques",male,36.0,0,0,SC/Paris 2163,12.8750,D,C
327,328,2,"Ball, Mrs. (Ada E Hall)",female,36.0,0,0,28551,13.0000,D,S
340,341,2,"Navratil, Master. Edmond Roger",male,2.0,1,1,230080,26.0000,F2,S
345,346,2,"Brown, Miss. Amelia ""Mildred""",female,24.0,0,0,248733,13.0000,F33,S
394,395,3,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.0,0,2,PP 9549,16.7000,G6,S
429,430,3,"Pickard, Mr. Berk (Berk Trembisky)",male,32.0,0,0,SOTON/O.Q. 392078,8.0500,E10,S
473,474,2,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",female,23.0,0,0,SC/AH Basle 541,13.7917,D,C
516,517,2,"Lemore, Mrs. (Amelia Milley)",female,34.0,0,0,C.A. 34260,10.5000,F33,S
618,619,2,"Becker, Miss. Marion Louise",female,4.0,2,1,230136,39.0000,F4,S
699,700,3,"Humblen, Mr. Adolf Mathias Nicolai Olsen",male,42.0,0,0,348121,7.6500,F G63,S
715,716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S
717,718,2,"Troutt, Miss. Edwina Celia ""Winnie""",female,27.0,0,0,34218,10.5000,E101,S
751,752,3,"Moor, Master. Meier",male,6.0,0,1,392096,12.4750,E121,S
772,773,2,"Mack, Mrs. (Mary)",female,57.0,0,0,S.O./P.P. 3,10.5000,E77,S
823,824,3,"Moor, Mrs. (Beila)",female,27.0,0,1,392096,12.4750,E121,S

In [314]:
len(temp_table.dropna())

25

In [316]:
len(temp_table.dropna(subset=['Cabin']))

28

In [317]:
len(temp_table.dropna(subset=['Age']))

528

In [318]:
len(temp_table.dropna(subset=['Age', 'Cabin']))

25

In [319]:
temp_table['Age'].mean()

26.692708333333332

In [320]:
temp_table['Age'].fillna(temp_table['Age'].mean())

0      22.000000
2      26.000000
4      35.000000
5      26.692708
7       2.000000
         ...
884    25.000000
885    39.000000
886    27.000000
888    26.692708
890    32.000000
Name: Age, Length: 675, dtype: float64

In [325]:
temp_table['Cabin'].fillna('lalalala')

0      lalalala
2      lalalala
4      lalalala
5      lalalala
7      lalalala
         ...
884    lalalala
885    lalalala
886    lalalala
888    lalalala
890    lalalala
Name: Cabin, Length: 675, dtype: object

In [328]:
temp_table['Age'].mean()

26.692708333333332

In [329]:
temp_table['Age'].fillna(temp_table['Age'].mean())

0      22.000000
2      26.000000
4      35.000000
5      26.692708
7       2.000000
         ...
884    25.000000
885    39.000000
886    27.000000
888    26.692708
890    32.000000
Name: Age, Length: 675, dtype: float64

In [330]:
age_without_nans = temp_table['Age'].fillna(temp_table['Age'].mean())

In [332]:
age_without_nans.isnull()

0      False
2      False
4      False
5      False
7      False
       ...
884    False
885    False
886    False
888    False
890    False
Name: Age, Length: 675, dtype: bool

In [333]:
age_without_nans.isnull().value_counts()

False    675
Name: Age, dtype: int64

In [321]:
temp_table['Age'].fillna(temp_table['Age'].mean()).isnull().value_counts()

False    675
Name: Age, dtype: int64

In [335]:
temp_table['Age']

0      22.0
2      26.0
4      35.0
5       NaN
7       2.0
       ...
884    25.0
885    39.0
886    27.0
888     NaN
890    32.0
Name: Age, Length: 675, dtype: float64

In [334]:
age_without_nans

0      22.000000
2      26.000000
4      35.000000
5      26.692708
7       2.000000
         ...
884    25.000000
885    39.000000
886    27.000000
888    26.692708
890    32.000000
Name: Age, Length: 675, dtype: float64

In [336]:
temp_table['Age'] = temp_table['Age'].fillna(temp_table['Age'].mean())

/Users/magnitofon/opt/anaconda3/envs/my_coursera/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Warning: потому что я не сделал copy

In [337]:
temp_table = pasInfo[condition_1].copy()

In [338]:
temp_table['Age'] = temp_table['Age'].fillna(temp_table['Age'].mean())

In [339]:
temp_table

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
2,3,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,3,"Moran, Mr. James",male,26.692708,0,0,330877,8.4583,NaN,Q
7,8,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
884,885,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,5,382652,29.1250,NaN,Q
886,887,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,26.692708,1,2,W./C. 6607,23.4500,NaN,S
890,891,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

**Что знаем и умеем?**

* `pd.DataFrame` как "ссылки" на объекты. Необходимость `copy` при попытке создания новой таблицы из имеющейся, чтобы избежать изменения оригинальной.
* Выделение элемента
* Выделение столбца, колонки
* Выделение подтаблицы
* Выделение через `[]`, через `.iloc[]`, через `loc[]`
* Фильтрация: выделение строк таких, что `<выполняется некоторое условие>`
* Логические операции над условиями для выделения
* Работа с пропущенными значениями
    * Выделение строк с пропущенными значениями
    * Выделение строк без пропущенными значениями
    * Выбрасывание строк с пропущенными значениями
    * Заполнение пропущенных значений каким-нибудь другим значением

<br><br>

## 5. Полезные мелочи

In [342]:
pasInfo = pd.read_csv('titanic_data.csv', dtype={'Pclass': str})

In [343]:
pasInfo.dtypes

PassengerId      int64
Pclass          object
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [344]:
pasInfo.describe()

       PassengerId         Age       SibSp       Parch        Fare
count   891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000   29.699118    0.523008    0.381594   32.204208
std     257.353842   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000   20.125000    0.000000    0.000000    7.910400
50%     446.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000   38.000000    1.000000    0.000000   31.000000
max     891.000000   80.000000    8.000000    6.000000  512.329200

In [345]:
pasInfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    object
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(6)
memory usage: 76.7+ KB

In [346]:
pasInfo.rename(columns={'Fare': 'TicketPrice'})

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,TicketPrice,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [348]:
pasInfo = pasInfo.rename(columns={'Fare': 'TicketPrice'})

In [349]:
pasInfo.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,TicketPrice,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [350]:
pasInfo['Fare'] = pasInfo['TicketPrice']

In [351]:
pasInfo.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,TicketPrice,Cabin,Embarked,Fare
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,7.2500
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,71.2833
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,7.9250
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,53.1000
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,8.0500

In [353]:
pasInfo.drop('TicketPrice', axis=1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked,Fare
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S,7.2500
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C,71.2833
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S,7.9250
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S,53.1000
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S,8.0500
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S,13.0000
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S,30.0000
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S,23.4500
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C,30.0000
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q,7.7500

In [354]:
pasInfo = pasInfo.drop('TicketPrice', axis=1)

In [355]:
pasInfo

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked,Fare
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S,7.2500
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C,71.2833
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S,7.9250
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S,53.1000
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S,8.0500
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S,13.0000
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S,30.0000
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S,23.4500
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C,30.0000
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q,7.7500

In [356]:
pasInfo = pasInfo.drop(['Pclass', 'Fare'], axis=1)

In [357]:
pasInfo

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [360]:
pasInfo.iloc[890]

PassengerId                    891
Name           Dooley, Mr. Patrick
Sex                           male
Age                             32
SibSp                            0
Parch                            0
Ticket                      370376
Cabin                          NaN
Embarked                         Q
Name: 890, dtype: object

In [359]:
type(pasInfo.iloc[890])

pandas.core.series.Series

In [361]:
last_row = pasInfo.iloc[890]

In [362]:
pasInfo.drop(890, axis=0)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...,...
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,NaN,Q
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C

In [363]:
pasInfo.drop(890, axis=0).append(last_row)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [366]:
pasInfo.set_index('PassengerId')

,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
PassengerId,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [367]:
pasInfo = pasInfo.set_index('PassengerId')

In [369]:
pasInfo.reset_index()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [370]:
pasInfo.sort_index()

,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
PassengerId,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q

In [371]:
pasInfo.sort_index(ascending=False)

,Name,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked
PassengerId,,,,,,,,
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,NaN,Q
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,C148,C
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,NaN,S
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,B42,S
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,NaN,S
...,...,...,...,...,...,...,...,...
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,NaN,S
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,C123,S
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,NaN,S
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C85,C
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,NaN,S

In [374]:
pasInfo.sort_index(ascending=False, axis=1)

,Ticket,SibSp,Sex,Parch,Name,Embarked,Cabin,Age
PassengerId,,,,,,,,
1,A/5 21171,1,male,0,"Braund, Mr. Owen Harris",S,NaN,22.0
2,PC 17599,1,female,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",C,C85,38.0
3,STON/O2. 3101282,0,female,0,"Heikkinen, Miss. Laina",S,NaN,26.0
4,113803,1,female,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",S,C123,35.0
5,373450,0,male,0,"Allen, Mr. William Henry",S,NaN,35.0
...,...,...,...,...,...,...,...,...
887,211536,0,male,0,"Montvila, Rev. Juozas",S,NaN,27.0
888,112053,0,female,0,"Graham, Miss. Margaret Edith",S,B42,19.0
889,W./C. 6607,1,female,2,"Johnston, Miss. Catherine Helen ""Carrie""",S,NaN,NaN
890,111369,0,male,0,"Behr, Mr. Karl Howell",C,C148,26.0
891,370376,0,male,0,"Dooley, Mr. Patrick",Q,NaN,32.0

In [376]:
pasInfo = pd.read_csv('titanic_data.csv', dtype={'Pclass': str})

In [377]:
pasInfo

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [378]:
pasInfo.sort_values('Fare')

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
271,272,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
597,598,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
302,303,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
633,634,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
277,278,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
438,439,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
341,342,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
737,738,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
258,259,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

In [379]:
pasInfo.sort_values(['Fare', 'Age'])

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
302,303,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
271,272,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
179,180,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0000,NaN,S
822,823,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
806,807,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
...,...,...,...,...,...,...,...,...,...,...,...
341,342,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
438,439,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
258,259,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C

In [381]:
pasInfo['Age'].drop_duplicates()

0      22.00
1      38.00
2      26.00
3      35.00
5        NaN
       ...
755     0.67
767    30.50
803     0.42
843    34.50
851    74.00
Name: Age, Length: 89, dtype: float64

In [ ]:
pasInfo.drop_duplicates()

In [382]:
pasInfo.drop_duplicates(subset=['Age'])

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.1000,C123,S
5,6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
755,756,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
767,768,3,"Mangan, Miss. Mary",female,30.50,0,0,364850,7.7500,NaN,Q
803,804,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
843,844,3,"Lemberopolous, Mr. Peter L",male,34.50,0,0,2683,6.4375,NaN,C
851,852,3,"Svensson, Mr. Johan",male,74.00,0,0,347060,7.7750,NaN,S

In [383]:
pasInfo.sample(n=10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
568,569,3,"Doharr, Mr. Tannous",male,NaN,0,0,2686,7.2292,NaN,C
118,119,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
687,688,3,"Dakic, Mr. Branko",male,19.0,0,0,349228,10.1708,NaN,S
538,539,3,"Risien, Mr. Samuel Beard",male,NaN,0,0,364498,14.5000,NaN,S
548,549,3,"Goldsmith, Mr. Frank John",male,33.0,1,1,363291,20.5250,NaN,S
669,670,1,"Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)",female,NaN,1,0,19996,52.0000,C126,S
46,47,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
857,858,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
135,136,2,"Richard, Mr. Emile",male,23.0,0,0,SC/PARIS 2133,15.0458,NaN,C
645,646,1,"Harper, Mr. Henry Sleeper",male,48.0,1,0,PC 17572,76.7292,D33,C

In [384]:
pasInfo.sample(frac=0.1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
784,785,3,"Ali, Mr. William",male,25.0,0,0,SOTON/O.Q. 3101312,7.0500,NaN,S
190,191,2,"Pinsky, Mrs. (Rosa)",female,32.0,0,0,234604,13.0000,NaN,S
110,111,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.0000,C110,S
638,639,3,"Panula, Mrs. Juha (Maria Emilia Ojala)",female,41.0,0,5,3101295,39.6875,NaN,S
400,401,3,"Niskanen, Mr. Juha",male,39.0,0,0,STON/O 2. 3101289,7.9250,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
50,51,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
60,61,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C
869,870,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
315,316,3,"Nilsson, Miss. Helmina Josefina",female,26.0,0,0,347470,7.8542,NaN,S
588,589,3,"Gilinski, Mr. Eliezer",male,22.0,0,0,14973,8.0500,NaN,S

In [ ]:
#HERE

In [385]:
mapper = {'male': 'М', 'female': 'Ж'}

In [386]:
pasInfo['Sex'].map(mapper)

0      М
1      Ж
2      Ж
3      Ж
4      М
      ..
886    М
887    Ж
888    Ж
889    М
890    М
Name: Sex, Length: 891, dtype: object

In [387]:
pasInfo['Name'].map(len)

0      23
1      51
2      22
3      44
4      24
       ..
886    21
887    28
888    40
889    21
890    19
Name: Name, Length: 891, dtype: int64

In [388]:
def get_first(name):
    return name.split()[0]

In [389]:
pasInfo['Name'].map(get_first)

0         Braund,
1        Cumings,
2      Heikkinen,
3       Futrelle,
4          Allen,
          ...
886     Montvila,
887       Graham,
888     Johnston,
889         Behr,
890       Dooley,
Name: Name, Length: 891, dtype: object

In [390]:
pasInfo['ShortName'] = pasInfo['Name'].map(get_first)

In [391]:
pasInfo

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ShortName
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"Braund,"
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"Cumings,"
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"Heikkinen,"
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"Futrelle,"
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"Allen,"
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,"Montvila,"
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,"Graham,"
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,"Johnston,"
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,"Behr,"
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,"Dooley,"

In [ ]:
pasInfo['Ticket'].map(get_first)

**Что знаем и умеем?**

* `df.describe()`, `df.info()`, `df.dtypes`
* Переименование столбцов
* Добавление/удаление столбцов
* Добавление/удаление строки
* Превращение столбцов в индекс. Сброс индекса
* Сортировка по индексам/колонкам. Сортировка по значениям
* Сброс дубликатов
* Генерация подвыборки - `df.sample`
* `map` - применение функций к значениям столбца